app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["description", ""], ["image_url", ""], ["category_id", 0], ["created_at", "2016-01-20 20:02:05.773993"], ["updated_at", "2016-01-20 20:02:05.773993"]]

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 38]]
UPDATE "products" SET "title" = $1, "category_id" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["title", "Best Shoes Ever"], ["category_id", 0], ["updated_at", "2016-01-20 20:18:23.727027"], ["id", 38]]